[
  {
    "title": "2. Vulnerability VII - Security Misconfiguration",
    "path": "/apuntes/ciberseguridad/thm/1-career/2-penetration-tester/2-web-fundamentals/4-web-hacking-fundamentals/6-owasp-api-security-top-10-2/2-vulnerability-vii-security-misconfiguration/",
    "src": "content/Ciberseguridad/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/4. Web Hacking Fundamentals/6. OWASP API Security Top 10 - 2/2. Vulnerability VII - Security Misconfiguration.md",
    "breadcrumb": "Ciberseguridad > THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 4. Web Hacking Fundamentals > 6. OWASP API Security Top 10 - 2",
    "content": "<h2>¿Cómo Ocurre?</h2>\nSecurity misconfiguration refleja una implementación de unos protocolos de seguridad incorrecta o pobremente configurados. Varios factores pueden resultar en esto, incluyendo configuración por defecto o completa, almacenamiento en la nube accesible automáticamente, [Cross-Origin Resource Sharing (CORS)](https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS), mensajes de error mostrando información sensible, etc. Los intrusos pueden aprovecharse de esto para realizar reconocimiento detallado.\n\nLa documentación API, una lista de endpoints, logs de error, etc no deben ser públicos.\n\n-------------------------------------------\n<h2>Impacto Posible</h2>\nPuede darle a los intrusos conocimiento completo de los componentes API. El rastreo de stack u otros errores detallados pueden ofrecer información confidencial y detalles esenciales del sistema.\n\n-------------------------------\n<h2>Ejemplo Práctico</h2>\n1. La compañía MHT se enfrenta a problemas de disponibilidad del servidor serios. Han asignado a Bob a desarrollar un endpoint API `/apirule/ping_v` (GET) que compartirá detalles sobre el estado y la salud del servidor.\n2. Bob ha diseñado exitosamente el endpoint. Sin embargo ha olvidado implementar manejo de errores para evitar la filtración de información.\n   ![[Pasted image 20251209205532.png]]\n3. El problema aquí es que en caso de una llamada fallida, el servidor manda un stack trace completo, conteniendo nombres de funciones, información sobre controladores y rutas, archivos, etc.\n4. La solución es crear un endpoint `/apirule7/ping_s` que maneje los errores y comparta sólo información deseada.\n   ![[Pasted image 20251209205834.png]]\n\n------------------------------\n<h2>Medidas de Mitigación</h2>\n- Limitar el acceso a interfaces administrativas para usuarios no autorizados y deshabilitarlas para otros usuarios.\n- Deshabilitar nombres de usuario y contraseñas por defecto para dispositivos públicos.\n- Deshabilitar el listado de directorios y configurar permisos correctamente para cada archivo.\n- Eliminar piezas de código innecesarias, logs de errores y debugging.",
    "modified": "2025-12-10T00:53:37"
  },
  {
    "title": "3. Vulnerability VIII - Injection",
    "path": "/apuntes/ciberseguridad/thm/1-career/2-penetration-tester/2-web-fundamentals/4-web-hacking-fundamentals/6-owasp-api-security-top-10-2/3-vulnerability-viii-injection/",
    "src": "content/Ciberseguridad/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/4. Web Hacking Fundamentals/6. OWASP API Security Top 10 - 2/3. Vulnerability VIII - Injection.md",
    "breadcrumb": "Ciberseguridad > THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 4. Web Hacking Fundamentals > 6. OWASP API Security Top 10 - 2",
    "content": "<h2>¿Cómo Ocurre?</h2>\nLos ataques de inyección son probablemente los más antiguos relacionados con la web/APIs y todavía se siguen cometiendo. Las debilidades de inyección ocurren cuando el input del usuario no se filtra y se procesa directamente por la API. Una inyección puede venir de SQL, un SO, XML, PHP, etc.\n\n---------------------------------\n<h2>Impacto Posible</h2>\nLas debilidades de inyección pueden llevar a divulgación de información, pérdida de datos, Dos, y toma completa de la cuenta. Los ataques exitosos también pueden causar que los intrusos accedan a información sensible o creen nuevas funcionalidades y ejecuten RCE.\n\n-----------------------------------\n<h2>Ejemplo Práctico</h2>\n1. Algunos usuario de MHT han reportado que su contraseña ha cambiado y que no pueden iniciar sesión en sus cuentas. El equipo de desarrollo se dio cuenta de que Bob había diseñado un endpoint API de login vulnerable `/apirule8/user/login_v` que no filtraba el input del usuario.\n2. Un atacante requiere el nombre de usuario del objetivo y para la contraseña puede usar `' OR 1=1--'` y obtener autorización para dicha cuenta.\n   ![[Pasted image 20251209211145.png]]\n3. Bob se dio cuenta del error y actualizó el endpoint API a `/apirule8/user/login_s` y usó queries parametrizadas y filtros ya construidos de Laravel para sanitizar.\n   ![[Pasted image 20251209211255.png]]\n\n---------------------------------------\n<h2>Medidas de Mitigación</h2>\n- Asegura usar una librería conocida para la validación del lado del cliente.\n- Si no se usa un framework, la información ofrecida por el usuario debe validarse y después filtrarse y sanitizarse.\n- Añade reglas de seguridad necesarias al Firewall de Aplicación Web (WAF).\n- Usa filtros preconstruidos en frameworks para validar el input del usuario.",
    "modified": "2025-12-10T00:53:37"
  },
  {
    "title": "4. Vulnerability IX - Improper Assets Management",
    "path": "/apuntes/ciberseguridad/thm/1-career/2-penetration-tester/2-web-fundamentals/4-web-hacking-fundamentals/6-owasp-api-security-top-10-2/4-vulnerability-ix-improper-assets-management/",
    "src": "content/Ciberseguridad/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/4. Web Hacking Fundamentals/6. OWASP API Security Top 10 - 2/4. Vulnerability IX - Improper Assets Management.md",
    "breadcrumb": "Ciberseguridad > THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 4. Web Hacking Fundamentals > 6. OWASP API Security Top 10 - 2",
    "content": "<h2>¿Cómo Ocurre?</h2>\nInnappropiate Asset Management se refiere al escenario donde tenemos dos versiones de una API disponibles en nuestro sistema; llamémoslas APIv1 y APIv2. Todo se migra a APIv2, pero APIv1 no ha sido borrada todavía. Cuanto más tiempo pase más peligroso será tenerla disponible e inactiva, pues eso significará que más desactualizada estará y por tanto más vulnerable será.\n\n---------------------------------\n<h2>Impacto Posible</h2>\nLas versiones más antiguas o no parcheadas de las APIs pueden permitir a los intrusos ganar acceso no autorizado a información confidencial o incluso completo control del sistema.\n\n-----------------------------------\n<h2>Ejemplo Práctico</h2>\n1. Durante el desarrollo API, la compañía MHT ha desarrollado diferentes versiones API como v1 y v2. La compañía se ha asegurado de usar las últimas versiones y llamadas pero ha olvidado eliminar la antigua versión del servidor.\n2. En consecuencia, se ha encontrado que llamadas antiguas de la API como `/apirule9/v1/user/login` devolvían más información de la necesaria como balance bancario, dirección, etc.\n   ![[Pasted image 20251209212800.png]]\n3. Bob se dio cuenta y ha desactivado la versión antigua dejando sólo `/apirule9/v2/user/login`.\n   ![[Pasted image 20251209212840.png]]\n\n-----------------------------------------\n<h2>Medidas de Mitigación</h2>\n- Acceso a llamadas API previas y sensibles deben ser bloqueadas a nivel de red.\n- Las APIs desarrolladas para R&D, QA, producción, etc deben ser segregadas y hosteadas en servidores separados.\n- Asegura que la documentación de todos los aspectos API, incluyendo la autentificación, redirecciones, errores, política CORS y la limitación de frecuencia.\n- Adopta estándares abiertos para generar documentación automáticamente.",
    "modified": "2025-12-10T00:53:37"
  },
  {
    "title": "1. Vulnerability VI - Mass Assignment",
    "path": "/apuntes/ciberseguridad/thm/1-career/2-penetration-tester/2-web-fundamentals/4-web-hacking-fundamentals/6-owasp-api-security-top-10-2/1-vulnerability-vi-mass-assignment/",
    "src": "content/Ciberseguridad/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/4. Web Hacking Fundamentals/6. OWASP API Security Top 10 - 2/1. Vulnerability VI - Mass Assignment.md",
    "breadcrumb": "Ciberseguridad > THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 4. Web Hacking Fundamentals > 6. OWASP API Security Top 10 - 2",
    "content": "<h2>¿Cómo Ocurre?</h2>\nMass Assignment refleja un escenario donde la información del lado del cliente se relaciona automáticamente con objetos o variables del lado del servidor. Los hackers explotan esta cualidad entendiendo la lógica de negocio de la aplicación y mandando información especialmente construida al servidor, adquiriendo permisos administrativos o insertando información alterada.\n\n---------------------------\n<h2>Impacto Posible</h2>\nEl ataque puede resultar en manipulación de información y escalada de privilegios desde un usuario normal a un administrador.\n\n---------------------------------------\n<h2>Ejemplo Práctico</h2>\n1. A Bob le han asignado desarrollar un endpoint API de registro `/apirule6/user` que tomará el nombre, nombre de usuario y contraseña como parámetros de input (POST). La tabla de usuarios tiene una columna `credit` con un valor de `50`. Los usuarios mejorarán su suscripción para tener un valor más alto.\n2. Bob ya ha diseñado el formulario y usado la funcionalidad de mass assignment en Laravel para guardar toda la información proveniente del lado del cliente a la base de datos.\n   ![[Pasted image 20251208210723.png]]\n3. El problema aquí es que Bob no está filtrando del lado del servidor. Como está usando la funcionalidad de mass assign, también está introduciendo valores de crédito en la base de datos que los atacantes pueden modificar.\n4. La solución es asegurarse de que se filtra del lado del servidor `/apirule6/user_s` y que el valor por defecto de crédito debe ser `50` incluso si se introduce otro valor del lado del cliente.\n   ![[Pasted image 20251208212012.png]]\n\n--------------------------------------\n<h2>Medidas de Mitigación</h2>\n- Antes de usar cualquier framework, debes estudiar cómo las inserciones y actualizaciones del backend se realizan. En el framework Laravel, los arrays [fillable y guarded](https://laravel.com/docs/9.x/eloquent#inserts) mitigan dichos escenarios.\n- Evita usar funciones que relacionen un input de un cliente a variables de código automáticamente.\n- Permite el cambio sólo de aquellas variables que deban ser actualizadas del lado del servidor.",
    "modified": "2025-12-10T00:53:37"
  },
  {
    "title": "5. Vulnerability X - Insufficient Logging & Monitoring",
    "path": "/apuntes/ciberseguridad/thm/1-career/2-penetration-tester/2-web-fundamentals/4-web-hacking-fundamentals/6-owasp-api-security-top-10-2/5-vulnerability-x-insufficient-logging-monitoring/",
    "src": "content/Ciberseguridad/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/4. Web Hacking Fundamentals/6. OWASP API Security Top 10 - 2/5. Vulnerability X - Insufficient Logging & Monitoring.md",
    "breadcrumb": "Ciberseguridad > THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 4. Web Hacking Fundamentals > 6. OWASP API Security Top 10 - 2",
    "content": "<h2>¿Cómo Ocurre?</h2>\nInsufficient logging and monitoring refleja un escenario donde un atacante realiza actividad maliciosa en un servidor. Sin embargo, cuando tratas de trackearlo, no hay suficientes métodos/evidencia debido a la falta de mecanismos de registro y monitorización. Muchas organizaciones se centran en el registro de sistemas pero se olvidan del de las APIs.\n\n--------------------------------\n<h2>Impacto Posible</h2>\nNo ser capaz de identificar al atacante/hacker detrás de un ataque.\n\n--------------------------------\n<h2>Ejemplo Práctico</h2>\n1. En el pasado, la compañía MHT ha sido susceptible de múltiples ataques y el actor no pudo ser identificado. Por eso Bob fue asignado a hacer un endpoint API `/apurule10/logging` (GET) que registrará los metadatos del usuario (dirección IP, versión del buscador, etc.) y lo guardará en una base de datos.\n   ![[Pasted image 20251209214130.png]]\n2. Después decidió que lo mejor sería redirigirlo a una solución SIEM para correlación y análisis.\n\n-----------------------------------------\n<h2>Medidas de Mitigación</h2>\n- Asegura el uso de SIEM (Security Information and Event Management) para manejo de logs.\n- Lleva un registro de todos los accesos denegados, autentificación fallida y errores de validación de inputs.\n- Maneja los logs como información sensible y asegura su integridad.",
    "modified": "2025-12-10T00:53:37"
  }
]