[
  {
    "title": "4. Injection Fundamentals",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/5-ldap-injection/4-injection-fundamentals/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/5. LDAP Injection/4. Injection Fundamentals.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 5. LDAP Injection",
    "content": "La inyección LDAP es una vulnerabilidad de seguridad cr´itica que ocurre cuando el input de un usuario no se sanitiza correctamente antes de incorporarlo en queries LDAP. \n\nLa inyección LDAP explota la forma en la que las aplicaciones web construyen queries LDAP. Cuando el input del usuario se añade directamente en estas queries sin una correcta sanitización y validación, los atacantes pueden inyectar  statements LDAP maliciosos.\n\nEl proceso es parecido al de la SQLi, donde se inyectan statements SQL maliciosos para manipular las operaciones de las bases de datos.\n\n------------------------------------------------\n<h2>Vectores de Ataques Comunes</h2>",
    "modified": "2026-01-15T00:53:38"
  },
  {
    "title": "3. Search Queries",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/5-ldap-injection/3-search-queries/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/5. LDAP Injection/3. Search Queries.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 5. LDAP Injection",
    "content": "Las queries de búsqueda de LDAP son fundamentales para interactuar con directorios LDAP permitiéndote localizar y recuperar información almacenada en el directoorio. Entender cómo construir estas queries es crucial para utilizar efectivamente los servicios LDAP.\n\nUna query de búsqueda LDAP consiste en varios componentes, cada uno usado para una cosa en la operación de búsqued:\n\n1. **Base DN (Distinguished Name):** Este es el punto de comienzo de la búsqueda en el árbol de directorios.\n2. **Scope:** Define cómo de profundo debe buscar desde el base DN. Puede ser uno de los siguientes:\n\t- `base`: Busca sólo el base DN.\n\t- `one`: Busca el hijo inmediao del base DN.\n\t- `sub`: Busca en el base DN y todos sus descendientes.\n3. **Filter:** Un criterio que debe coincidir con el resultado para que sea devuelto. Usa una sintaxis específica.\n4. **Attributes:** Especifica qué características de las entradas coincidentes deberían ser devueltas en los resultados.\n\nLa sintaxis básica de una query de búsqueda LDAP es como:\n\n```default\n(base DN) (scope) (filter) (attributes)\n```\n\n-----------------------------------------------\n<h2>Filtros y Sintaxis</h2>\nLos filtros son el núcleo de las queries de búsqueda LDAP, definiendo las condiciones que lass entradas en el directorio deben cuemplir para ser incluídas en los resultados de búsqueda. La sintaxis de los filtros LDAP se define en [RFC 4515](https://www.openldap.org/lists/ietf-ldapbis/200606/msg00010.html), donde los filtros se presentan como strings con un formato específico como `(canonicalName=value)`. Estos filtros pueden usar una variedad de operadores para refinar los criterios de búsqueda, incluyendo igualdad (`=`), presencia (`=*`), mayor y menor que (`>=`/`<=`).\n\nUno de los operadores más esenciales de LDAP es `*` el cual significa que coincida cualquier caracter. Este operador es crucial para formular coincidencias amplias o parciales.\n\n---------------------------------------------\n<h2>Ejemplos de Filtros</h2>\n<h4>Filtro Sencillo:</h4>\n```default\n(cn=John Doe)\n```\n\nEste filtro devuelve entradas con un canonical name (`cn`) exactamente igual a \"John Doe\".\n\n<h4>Wildcards:</h4>\n```php\n(cn=J*)\n```\n\nEste filtro aplica el operador wildcard para que los resultados coincidan con cualquier `cn` que comience con \"J\".\n\n<h4>Filtros Complejos con Operadores Lógicos:</h4>\nPara queries de búsqueda más complejas, podemos usar filtros con operadores lógicos como AND (`&`), OR (`|`) o NOT (`!`).\n\n```default\n(&(objectClass=user)(|(cn=John*)(cn=Jane*)))\n```\n\nEste filtro busca entradas clasificadas como \"user\" en su clase de objeto y tenga un canocical name que comience o con \"John\" o con \"Jane\".\n\nAunque no suelen estar expuestos, los servicios LDAP pueden ser accesibles a través de la red vía los puertos 389 (para conexiones StartTLS no encriptadas) y el 535 (para conexxiones SSL/TLS). Cuando los servicios LDAP son accesibles públicamente, herramientas como `ldapsearch` pueden ser usadas para interactuar con el servidor LDAP. Esta herramienta permite a un usuario realizar queries y modificar el directorio LDAP desde la línea de comandos.\n\n```bash\nuser@tryhackme$ ldapsearch -x -H ldap://MACHINE_IP:389 -b \"dc=ldap,dc=thm\" \"(ou=People)\"\n# extended LDIF\n#\n# LDAPv3\n# base <dc=ldap,dc=thm> with scope subtree\n# filter: (ou=People)\n# requesting: ALL\n#\n\n# People, ldap.thm\ndn: ou=People,dc=ldap,dc=thm\nobjectClass: organizationalUnit\nobjectClass: top\nou: People\n\n# search result\nsearch: 2\nresult: 0 Success\n\n# numResponses: 2\n# numEntries: 1\n```\n\nEste comando usa `ldapsearch` para realizar una búsqueda contra un servidor LDAP localizado en el puerto 389, comenzando en el base DN `dc=ldap,dc=thm` y usando un filtro que buscarña entradas bajo la OU \"People\".",
    "modified": "2026-01-15T00:53:38"
  },
  {
    "title": "2. Structure",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/5-ldap-injection/2-structure/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/5. LDAP Injection/2. Structure.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 5. LDAP Injection",
    "content": "En LDAP, las entradas de directorios están estructurados como objetos, cada uno adhiriéndose a un esquema específico que define las reglas y atributos aplicables al objeto. Este acercamiento orientado a objetos asegura consistencia y dirige cómo objetos como los usuarios o grupos se representan y manipulan en el directorio.\n\n<h4>Servicios que usan LDAP</h4>\n- **Microsoft Active Directory:** Un servicio para redes de dominio de Windows utiliza LDAP como pate de su protocolo base mpara manejar recursos de dominios.\n- **OpenLDAP:** Una implementación de código abierto de LDAP ampliamenet usada para manejar la información de los usuarios.\n\n--------------------------------------\n<h2>Formato LDIF</h2>\nLas entradas LDAP pueden representarse usando el LDAP Data Interchange Format (LDIF), un formato estándar de texto plano para representar entradas de directorios LDAP y operaciones de actualización. LDIF importa y exporta contenidos de directorio y describe modificaciones de directorios como añadir, modificar o eliminar entradas.\n\n--------------------------------------\n<h2>Estructura</h2>\nUn directorio LDAP sigue una estructura jerárquica como el árbol del sistema de archivos. Esta estructura comprende varias entradas representando un único ítem, como usuario, grupo o recurso.\n\n![[Pasted image 20260113152745.png]]\n\nArriba del árbol LDAP encontramos el **TLD (top-level domain)**, como `dc=ldap,dc=thm`. Debajo del TLD puede haber **subdominios** u **organizational units (OUs)** como `ou=people` p `ou=groups`, las cuales categorizan las entradas de directorios.\n\n- **Distinguished Names (DNs):** Sirve como identificador únicao para cada entrada en el directorio especificando el camino desde arriba hasta la entrada, por ejemplo: `cn=John Doe,ou=people,dc=example,dc=com`.\n- **Relative Distinguished Names (RDNs):** Representa niveles individuales en la jerarquía de directorios, como `cn=John Doe`, donde `cn` significa **Common Name**.\n- **Atributos:** Definen las propiedades de las entradas de directorios, como `mail=john@example.com`.",
    "modified": "2026-01-14T00:57:10"
  },
  {
    "title": "1. Introduction",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/5-ldap-injection/1-introduction/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/5. LDAP Injection/1. Introduction.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 5. LDAP Injection",
    "content": "LDAP, que significa Lightweight Directory Access Protocol (Protocolo de Acceso a Directorios Ligero), es un protocolo ampliamente usado para acceder y mantener servicios de información en directorios distribuidos mediante IP (Internet Protocol). Permite a las organizacione manejar a usuarios centralmente, así como grupos y otra informaciñon de directorios, normalmente usado para propósitos de autentificación y autorización en aplicaciiones web e internas.\n\n------------------------------------------\n<h2>Objetivos</h2>\n1. Ofrecer un entendimiento concienzudo de LDAP y su rol en los servicios de directorios.\n2. Explorar el árbol de estructura de LDAP y sus componentes clave.\n3. Introducción a LDAP injection, su impacto y cómo puede ser explotada.\n4. Equiparse con los conocimientos y habilidades necesarias para identificar y mitigar las vulnerabilidades de inyección LDAP.\n\n---------------------------------------\n<h2>Pre-requisitos</h2>\n1. Entendimiento básico de cómo funcionan los servicios de directorios.\n2. Conocimiento básico de principios de seguridad de aplicaciones web y vulnerabilidades comunes.\n3. Familiaridad de la estructura y los componentes de LDAP, como Distinguished Names (DNs) y atributos.\n4. Experiencia con herramientas y técnicas de testeo de seguridad en aplicaciones web como OWASP ZAP o Burp Suite.",
    "modified": "2026-01-14T00:57:10"
  },
  {
    "title": "9. Mitigation",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/4-server-side-template-injection/9-mitigation/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/4. Server-Side Template Injection/9. Mitigation.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 4. Server-Side Template Injection",
    "content": "La Server-Side Template Injection puede ser mitigada siguiendo un conjunto de buenas prácticas e implementando medidas de seguridad en el código de la aplicación. Aquí está cómo mitigar SSTI en Smarty, Jade y Jinja2:\n\n----------------------------------------\n<h2>Jinja2</h2>\n1. **Modo Snadbox:** Habilita el entorno sandboxeado en Jinja2 para restringir la habilidad de la plantilla para acceder a funciones y atributos inseguros. Esto previene la ejecución arbitraria de código.\n\n```python\nfrom jinja2 import Environment, select_autoescape, sandbox\n\nenv = Environment(\n    autoescape=select_autoescape(['html', 'xml']),\n    extensions=[sandbox.SandboxedEnvironment]\n)\n```\n\n2. **Sanitización de Input:** Sanitiza siempre el input para escapar o eliminar caracteres y strings potencialmente peligrosos que puedan ser interpretados como código.\n3. **Auditoría de plantilla:** Revisa y audita regularmente las plantilas en busca de patrones de código inseguros, como directamente incrustar el input del usuario sin sanitización.\n\n--------------------------------------\n<h2>Jade(Pug)</h2>\n1. **Evita Evaluación Directa de JavaScript:** Restringe o evita uar la habilidad de Pug para evaluar código JavaScript en las plantillas. Usa métodos alternativos para manejar contenido dinámico que no involucre ejecución directa de código:\n   \n```pug\nvar user = !{JSON.stringify(user)}\nh1= user.name\n```\n\nUsa `!{}` con cuidado ya que permite putput no escapado, lo que puede ser peligroso. Mejor usa `#{}` que si espaca HTML por defecto.\n\n2. **Valida y sanitiza los Inputs:** Asegúrate de que todos los inputs del usuario sean validados contra el esquema estricto y sanitizados antes de que sean renderizados por el motor. Esto reduce el riesgo de ejecución de código arbitraria.\n3. **Ajusta la Configuración para que sea Segura:** Usa configuraciones de entorno que minimicen riesgos, como deshabilitar funcionalidades que permitan la ejecución del script.\n\n-----------------------------------------\n<h2>Smarty</h2>\n1. **Deshabilita las Etiquetas `{php}`:** Asegúrate de que las etiquetas `{php}` estén deshabilitadas en la configuración de Smarty para prevenir la ejecución de PHP en las plantillas.\n\n```php\n$smarty->security_policy->php_handling = Smarty::PHP_REMOVE;\n$smarty->disable_security = false;\n```\n\n2. **Usa Manejadores Seguros:** Si debes permitir a los usuarios personalizar las plantillas, ofrece un conjunto de etiquetas o modificadores que puedan usar, lo que no permite la ejecuiñon directa de comandos o acceso a la shell.\n3. **Revisiones Regulares de Seguridad:** Realiza revisiones de seguridad de los archivos de plantillas y la lógica de manejo de información para asegurar que no hay prácticas inseguras. Actualiza Smarty regularmente.\n\n---------------------------------\n<h2>Sandboxing in Template Engines</h2>\nEs una funcionalidad de seguridad que restringe la ejecución de código potencialmente malicioso en las plantillas. Limita las acciones que pueden realizar estas como operaciones con archivos o ejecución de comandos en el sistema. La debida sandboxing ayuda a prevenir problemas de seguridad.\n\n<h4>Importancia del Sandboxing</h4>\n- **Restricciones de Funciones:** Limita las funciones o métodos que pueden ser llamados desde la plantilla, bloqueando operaciones potencialmente peligrosas.\n- **Acceso a Variables e Información:** Controla el acceso a variables globales e información sensible, asegurando que las plantillas no pueden manipular o exponer la información crítica.",
    "modified": "2026-01-14T00:57:10"
  }
]