[
  {
    "title": "2. Finding the flags",
    "path": "/apuntes/thm/maquinas/1-easy/3-lookup/2-finding-the-flags/",
    "src": "content/Ciberseguridad/THM/Maquinas/1. Easy/3. Lookup/2. Finding the flags.md",
    "breadcrumb": "THM > Maquinas > 1. Easy > 3. Lookup",
    "content": "1. Analizamos la dirección que nos dan.\n   ![[Pasted image 20251219193414.png]]\n2. Hacemos un poco más de enumeración.\n   ![[Pasted image 20251219193541.png]]\n3. Y un poco más de reconocimiento.\n   ![[Pasted image 20251219194552.png]]\n   ![[Pasted image 20251219194626.png]]\n4. Vamos a ver la página web, `/login.php` está vacía y `/index.php` es la misma que sin poner nada.\n   ![[Pasted image 20251123192534.png]]\n5. Vamos a abrir Burp Suite y a ver como se ve una petición fallida.\n   ![[Pasted image 20251219195722.png]]\n6. Probamos a hacer fuerza bruta.\n   ![[Pasted image 20251219202217.png]]\n   Nada.\n7. Vamos a enumerar más.\n   ![[Pasted image 20251219202454.png]]\n   Seguimos sin nada.\n8. Si probamos con el usuario `admin`, vemos que la respuesta es diferente.\n   ![[Pasted image 20251219203726.png]]\n9. Vamos a lanzar el ataque para el usuario `admin` filtrando aquellas respuestas en las que aparezca `Wrong password`.\n   ![[Pasted image 20251219205153.png]]\n10. Si intentamos loguearnos con estas credenciales nos dice que `Wrong username or password`.\n    ![[Pasted image 20251219205831.png]]\n11. Volvemos a Burp Suite. Vamos a recapitular lo que tenemos.\n\t1. Si metemos un usuario y una contraseña equivocada: `Wrong username or password`.\n\t2. Si metemos un usuario existente y una contraseña equivocada: `Wrong password.`\n\t3. Si metemos un usuario existente y una contraseña que en principio pensábamos acertada, nos sale: `Wrong username or password`.\n\t   Basándonos en esto podemos deducir que la contraseña es correcta, pero no para el usuario `admin`.\n12. Vamos a hacer fuerza bruta contra el usuario.\n    ![[Pasted image 20251219212157.png]]\n    Grande jose.\n13. Nos logueamos con `jose:password123`. Esto nos lleva a `files.lookup.thm` lo tenemos que meter en `/etc/hosts`.\n    ![[Pasted image 20251219213449.png]]\n    Parece que hay un botón de subida de archivos así que vamos a intentar subir una reverse shell.\n14. Intentamos subir la shell.\n    ![[Pasted image 20251219214012.png]]\n    Salta error, vamos a cambiar la extensión a `.txt`.\n15. Subimos `reverseshell.txt`.\n    ![[Pasted image 20251219214252.png]]\n    Tampoco va.\n16. Vamos a probar con Burp Suite a ver qué vemos.\n    ![[Pasted image 20251219214717.png]]\n    Intentando subir un archivo JS me lo deniega también.\n17. Vamos a realizar más investigación en la página (sí, más enumeración).\n    ![[Pasted image 20251219235133.png]]\n    Encontramos un botón que nos deja ver el software de gestión junto a la versión: `elFinder 2.1.47`.\n18. Buscamos en una base de datos de exploits.\n    ![[Pasted image 20251219235406.png]]\n19. El método encontrado no soporta autentificación por lo que vamos a ver si podemos acceder al endpoint de subida sin autentificarnos.\n    ![[Pasted image 20251219235606.png]]\n    Efectivamente sí se puede.\n20. El código de Exploit-DB no ha funcionado por lo que buscamos en GitHub.\n    ![[Pasted image 20251220000317.png]]\n21. Nos ponemos en escucha.\n    ![[Pasted image 20251220000435.png]]\n22. Lo ejecutamos como dice.\n    ![[Pasted image 20251220000512.png]]\n23. Obtenemos la shell.\n    ![[Pasted image 20251220000534.png]]\n24. Después de estabilizar la shell y buscar un poco nos encontramos con el archivo que contiene la flag de user.\n    ![[Pasted image 20251220001350.png]]\n    Pero no podemos leerla con nuestros permisos actuales, ni el archivo `.passwords` tampoco.\n25. Después de hacer `sudo -l` y ver que no podemos hacer nada, probamos a buscar archivos SUID.\n    ![[Pasted image 20251220001521.png]]\n26. Tanto `pkexec` como `pwm` llaman mi atención. Comprobaremos la versión de pkexec.\n    ![[Pasted image 20251220003250.png]]\n    Es la 0.105, buscaremos un exploit.\n27. Hemos encontrado un exploit.\n    ![[Pasted image 20251220003335.png]]\n28. Seguimos las instrucciones y no funciona de ninguna manera.\n    ![[Pasted image 20251220003957.png]]\n29. Vamos a investigar el otro SUID sospechoso: `/usr/sbin/pwm`.\n    ![[Pasted image 20251220004107.png]]\n    Parece que ejecuta `id` y luego lo usa para meterlo en una ruta. Si consiguiéramos que extrajese `think` podríamos leer el archivo `.passwords`.\n30. Comprobamos el `$PATH`.\n    ![[Pasted image 20251220004717.png]]\n    Parece que podemos modificarlo. Ahora sólo tenemos que hacer un script y guardarlo en `/tmp/id` y se ejecutará en lugar de el verdadero `id`.\n31. Creamos el script y le damos permisos de ejecución con `chmod +x /tmp/id`.\n    ![[Pasted image 20251220005102.png]]\n32. Volvemos a ejecutar `/user/sbin/pwm`.\n    ![[Pasted image 20251220005303.png]]\n    Obtenemos lo que parece una lista de contraseñas.\n33. Vamos a probar fuerza bruta con dicha lista contra el usuario `think` por ssh.\n    ![[Pasted image 20251220005624.png]]\n34. Iniciamos sesión con el usuario `think` y leemos la flag.\n    ![[Pasted image 20251220005827.png]]\n35. Buscando maneras de escalar privilegios nos encontramos con `/usr/bin/look`.\n    ![[Pasted image 20251220005959.png]]\n36. Si miramos en GTFOBins:\n    ![[Pasted image 20251220010030.png]]\n    BINGO!\n37. Seguimos los pasos.\n    ![[Pasted image 20251220010149.png]]\n    En este caso se trata de un SHA512, lo sabemos gracias al comienzo: `$6$`. Además vemos que el formato es `salt.pass`.\n38. Miramos en el manual de `hashcat`:\n    ![[Pasted image 20251220011106.png]]\n39. Vamos a usar `hashcat` con `rockyou.txt` para obtener la contraseña.\n    ![[Pasted image 20251220011225.png]]\n    ![[Pasted image 20251220021852.png]]\n    No hemos encontrado la contraseña así. Es por eso que pensaremos en otra manera.\n40. Si podemos leer cualquier archivo como sudo, en realidad también podemos leer la clave ssh de root y usarla desde nuestra propia máquina para conectarnos como root. Empezamos leyéndola.\n    ![[Pasted image 20251220012038.png]]\n41. La copiamos en nuestra máquina y la usamos para iniciar sesión.\n    ![[Pasted image 20251220012535.png]]\n    MUY IMPORTANTE CAMBIAR LOS PERMISOS A `600` (`rw-------`).\n42. Leemos la flag.\n    ![[Pasted image 20251220012759.png]]\n\n>[!SUCCESS] Hemos pwneado la máquina y obtenido ambas flags. Phew! Vaya máquina mas \"easy\", ¿verdad? ;)",
    "modified": "2025-12-20T01:49:23"
  },
  {
    "title": "3. AS04 - Cryptographic Failures",
    "path": "/apuntes/thm/1-career/2-penetration-tester/2-web-fundamentals/5-owasp-top-10-2025/2-owasp-top-10-2025-application-design-flaws/3-as04-cryptographic-failures/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/5. OWASP Top 10 - 2025/2. OWASP Top 10 2025 - Application Design Flaws/3. AS04 - Cryptographic Failures.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 5. OWASP Top 10 - 2025 > 2. OWASP Top 10 2025 - Application Design Flaws",
    "content": "<h2>¿Qué es?</h2>\nLos errores de criptografía ocurren cuando la encriptación se usa mal o ni siquiera se usa. Esto incluye algoritmos débiles, claves hardcodeadas, manejo débil de claves o información sensible sin encriptar.\n\n--------------------------------------\n<h2>¿Por qué importa?</h2>\nLas aplicaciones web usan la criptografía en todos lados: para proteger el tráfico de red, para asegurar la información almacenada, verificar identidades y para guardar secretos. Cuando estos controles fallan, la información sensible puede ser expuesta conllevando tomas de posesión de cuentas o brechas de seguridad a gran escala.\n\n------------------------------------\n<h2>Patrones Comunes</h2>\n- Usar algoritmos débiles o deprecados como MD5, SHA-1 o ECB.\n- Secretos hardcodeados en código o configuración.\n- Prácticas pobres de rotación de claves.\n- Falta de encriptación de datos sensibles ya sean guardados o en tránsito.\n- Certificados TLS inválidos o autofirmados.\n- Usar sistemas AI/ML sin manejo adecuado de secretos para inputs sensibles.\n\n----------------------------\n<h2>Cómo Prevenirlo</h2>\n- Usa algoritmos modernos y fuertes como AES-GCM, ChaCha20-Poly1305, o TLS 1.3 con certificados válidos.\n- Usa servicios de manejo de claves seguros como Azure Key Vault, AWS KMS o HashiCorp Vault.\n- Rota los secretos y claves regularmente, siguiendo periodos crypto definidos.\n- Documenta y refuerza políticas y procedimientos estándar para el manejo del ciclo de vida de las claves.\n- Mantén un inventario completo de certificados, claves y sus propietarios.\n- Asegúrate de que los modelos de IA y agentes de automatización no expongan secretos no encriptados o información sensible.\n\n--------------------------------------------\n<h2>Reto</h2>\nNavega hasta el puerto `5004` de la IP dada. ¿Puedes encontrar la clave para descifrar el archivo?\n\n1. Vamos a la página dada.\n   ![[Pasted image 20251219142626.png]]\n2. Vamos a leer el código fuente.\n   ![[Pasted image 20251219142713.png]]\n   Parece que hay un JavaScript para desencriptar el archivo: `/static/js/decrypt.js`.\n3. Lo leemos.\n   ![[Pasted image 20251219142822.png]]\n   Hemos encontrado la clave secreta.\n4. Para desencriptarlo vamos a CyberChef.\n\t1. Añadimos lo encriptado en el input.\n\t   ![[Pasted image 20251219143725.png]]\n\t2. Cargamos el módulo AES Decrypt y configuramos la clave,  ECB y Raw tanto como input como output.\n\t   ![[Pasted image 20251219144034.png]]\n\t   Esto ocurre porque el input no es Raw, sino base64.\n\t3. Le añadimos From Base64.\n\t   ![[Pasted image 20251219144121.png]]",
    "modified": "2025-12-20T01:49:23"
  },
  {
    "title": "4. AS06 - Insecure Design",
    "path": "/apuntes/thm/1-career/2-penetration-tester/2-web-fundamentals/5-owasp-top-10-2025/2-owasp-top-10-2025-application-design-flaws/4-as06-insecure-design/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/5. OWASP Top 10 - 2025/2. OWASP Top 10 2025 - Application Design Flaws/4. AS06 - Insecure Design.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 5. OWASP Top 10 - 2025 > 2. OWASP Top 10 2025 - Application Design Flaws",
    "content": "<h2>¿Qué es?</h2>\nEl diseño inseguro ocurre cuando se construye un sistema con un fallo de lógica o arquitectura. Estas debilidades van desde saltarse el modelado de amenazas o no requerimientos/comprobaciones de diseño hasta errores accidentales.\n\nAdemás, con la introducción de modelaje con asistentes de IA, estos exacerban estos diseños inseguros. Los desarrolladores suelen asumir que los modelos son seguros, correctos o que su código no tiene fallos. Nada más lejos de la realidad.\n\n---------------------------------------\n<h2>Ejemplo</h2>\nUn buen ejemplo es Clubhouse. Su diseño temprano asumía que los usuarios sólo interactuarían a través de la app de móvil, por lo que el backend API no contaba con autentificación adecuada. Cualquiera podía mandar queries para obtener información de usuarios, rooms e incluso conversaciones privadas.\n\n---------------------------------------------\n<h2>¿Por qué importa?</h2>\nNo puedes parchear un diseño inseguro, está construido en el workflow, la lógica y las fronteras de confianza. Arreglarlo implica repensar cómo los sistemas (y ahora la IA también) toman las decisiones.\n\n-----------------------------------\n<h2>Diseño Inseguro en 2025</h2>\n- Controles de lógica de negocio débiles.\n- Asunción erróneas sobre el comportamiento del usuario/modelo.\n- Componentes IA sin autoridad o acceso adecuado.\n- Guardas faltantes para agentes LLM y de automatización.\n- Bypasses de testeo o debug dejados en producción.\n- Reviews de casos de abuso o modelos de amenaza IA inconsistentes.\n\n---------------------------------------\n<h2>Diseño Inseguro en la Era de la IA</h2>\nLa IA introduce nuevos tipos de fallos de diseño. Por ejemplo, la inyección de prompts ocurre cuando el input de un usuario se mezcla con prompts de sistema. La confianza ciega en el output del modelo crea sistemas frágiles que actúan con decisiones de IA sin validación. Cuando se trata de modelos envenenados, tomados de fuentes no verificadas, pueden contener comportamientos ocultos o backdoors que comprometan el sistema desde dentro.\n\n------------------------------------\n<h2>¿Cómo diseñar de forma segura?</h2>\n- Trata cada modelos como no fiable hasta demostrar lo contrario.\n- Valida y filtra todos los inputs y outputs para asegurar precisión e integridad.\n- Separa los prompts de sistema del contenido del usuario.\n- Mantén la información sensible fuera de prompts a no ser que sea absolutamente necesario y en tal caso protégela de manera estricta.\n- Usa revisión humana para acciones de IA de alto riesgo.\n- Registra la proveniencia del modelo y el comportamiento y aplica privacidad diferencial para información sensible.\n- Incluye modelos de amenaza específicos de IA para ataques de prompts, mal uso del agente y cadena de suministro.\n- Construye el modelado de amenazas durante todas las fases del desarrollo, no sólo al inicio.\n- Define requerimientos de seguridad claros para cada funcionalidad antes de su implementación.\n- Aplica el principio de los menores privilegios en usuario, APIs y servicios.\n- Asegura autentificación, autorización y manejo de sesiones adecuadas a lo largo del sistema.\n- Mantén verificadas las dependencias, componentes de terceros y recursos de la cadena de suministro.\n- Monitoriza y testea el sistema continuamente en busca de fallos de lógica, paths de abuso y riesgos emergentes.\n\n------------------------------------------------\n<h2>Reto</h2>\nNavega al puerto `5005` de la IP dada. ¿Han asumido que sólo dispositivos móviles pueden acceder?\n\n1. Vamos a la página dada.\n   ![[Pasted image 20251219162451.png]]\n2. Sabemos que hay una api así que vamos a probar a mandar un escaneo a `/api`.\n   ![[Pasted image 20251219164328.png]]\n3. Vemos el endpoint `/users` así que vamos a ver qué hay en él.\n   ![[Pasted image 20251219163852.png]]\n4. Haciendo un poco de ejercicio mental, nos hablan de mensajes, pero no hay mensajes por ningún lado. Tenemos los usuarios, por lo que probaremos a ver si en el directorio `/messages` hay algo, aunque no lo hayamos encontrado en el escaneo.\n   ![[Pasted image 20251219163933.png]]",
    "modified": "2025-12-20T01:49:23"
  },
  {
    "title": "1. AS02 - Security Missconfigurations",
    "path": "/apuntes/thm/1-career/2-penetration-tester/2-web-fundamentals/5-owasp-top-10-2025/2-owasp-top-10-2025-application-design-flaws/1-as02-security-missconfigurations/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/5. OWASP Top 10 - 2025/2. OWASP Top 10 2025 - Application Design Flaws/1. AS02 - Security Missconfigurations.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 5. OWASP Top 10 - 2025 > 2. OWASP Top 10 2025 - Application Design Flaws",
    "content": "<h2>¿Qué es?</h2>\nLas malas configuraciones de seguridad aparecen cuando el sistema, servidores o aplicaciones se despliegan con valores por defecto inseguros, configuraciones incompletas o servicios expuestos. No son bugs de código sino errores en cómo el entorno, software o red se configuran.\n\n--------------------------------------\n<h2>¿Por qué importa?</h2>\nIncluso pequeñas malas configuraciones pueden exponer información sensible, habilitar escalada de privilegios o darle a los atacantes un pie dentro del sistema. Las aplicaciones modernas confían en stacks complejos, servicios de nube y APIs de terceros. Un sólo panel administrativo expuesto, un bucket de almacenamiento abierto o permisos mal configurados pueden comprometer el sistema entero.\n\n-------------------------------------------\n<h2>Ejemplo</h2>\nEn 2017, Uber expuso un bucket AWS S3 de backup con información sensible de usuarios, incluyendo información de conductores y riders porque el bucket era accesible públicamente. Esto muestra que un error de despliegue puede llevar a una brecha importante.\n\n------------------------------------\n<h2>Patrones Comunes</h2>\n- Credenciales por defecto o contraseña débil sin cambiar.\n- Servicios o endpoints innecesarios expuestos a internet.\n- Permisos o almacenamiento en nube mal configurado (S3, Azure Blob, GCP buckets).\n- Acceso no restringido a APIs o falta de autentificación/autorización.\n- Muestra de mensajes de error exponiendo trazas del stack o detalles de sistema.\n- Software, frameworks o contenedores desactualizados con vulnerabilidades conocidas.\n- Endpoints AI/ML expuestos sin controles de acceso adecuados.\n\n----------------------------\n<h2>Cómo Prevenirlo</h2>\n- Reforzar configuraciones por defecto y borrar servicios y funcionalidades no utilizados.\n- Reforzar una autentificación fuerte y los menores privilegios a lo largo del sistema.\n- Limitar la exposición de red y recursos sensibles.\n- Mantener el software, frameworks y contenedores actualizados.\n- Esconder mensajes de error para evitar revelar información de más.\n- Auditar configuraciones de nube y permisos de forma regular.\n- Securizar los endpoints AI y servicios de automatización con controles de acceso y monitorización adecuada.\n- Integrar comprobaciones de configuración y seguridad en el proceso de despliegue.\n\n----------------------------------------\n<h2>Reto</h2>\nNavega hasta el puerto `5002` de la IP dada. Parece que los desarrolladores se dejaron bastantes trazas en sus APIs de Control de Usuarios.\n\n1. Vamos a la página dada.\n   ![[Pasted image 20251219102758.png]]\n2. Hacemos lo que nos dice para interactuar con la API.\n   ![[Pasted image 20251219102859.png]]\n3. Vamos probando y con números positivos y `0` no vemos nada, por lo que probamos un número que creemos que dará un error (`-1`).\n   ![[Pasted image 20251219103021.png]]",
    "modified": "2025-12-20T01:49:23"
  },
  {
    "title": "2. AS03 - Software Supply Chain Failures",
    "path": "/apuntes/thm/1-career/2-penetration-tester/2-web-fundamentals/5-owasp-top-10-2025/2-owasp-top-10-2025-application-design-flaws/2-as03-software-supply-chain-failures/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/2. Web Fundamentals/5. OWASP Top 10 - 2025/2. OWASP Top 10 2025 - Application Design Flaws/2. AS03 - Software Supply Chain Failures.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 2. Web Fundamentals > 5. OWASP Top 10 - 2025 > 2. OWASP Top 10 2025 - Application Design Flaws",
    "content": "<h2>¿Qué es?</h2>\nLos fallos en la cadena de suministro de software ocurren cuando las aplicaciones confían en componentes, librerías, servicios o modelos comprometidos, desactualizados o sin verificación adecuada. Estas debilidades no son inherentes al código, sino a las herramientas y software del que depende.\n\n--------------------------------------\n<h2>¿Por qué importa?</h2>\nLas aplicaciones modernas están construidas a partir de paquetes, APIs y modelos de IA de terceros. Una dependencia comprometida puede comprometer el sistema completo, permitiendo a los atacantes ganar acceso sin tocar tu código. Además este tipo de ataque puede ser automatizado y distribuido.\n\n-------------------------------------------\n<h2>Ejemplo</h2>\nEn 2021, SolarWinds fue comprometida y esto mostró el peligro de este tipo de ataques. Los atacantes insertaron código malicioso en una actualización confiable, afectando a miles de organizaciones que inmediatamente la instalaron. No fue un bug en la lógica del código, sino una debilidad en el proceso de construcción de actualizaciones, verificación y distribución.\n\n------------------------------------\n<h2>Patrones Comunes</h2>\n- Usar librerías o dependencias sin verificar o no mantenidas.\n- Instalar automáticamente actualizaciones sin verificación.\n- Sobredependencia de modelos IA de terceros sin auditoría.\n- Procesos de montaje inseguros o procesos CI/CD que permiten manipulación.\n- Falta de supervisión de vulnerabilidades en las dependencias implementadas.\n- Rastreo deficiente de licencias o procedencia de los componentes.\n\n----------------------------\n<h2>Cómo Prevenirlo</h2>\n- Verifica todos los componentes, librerías y modelos IA de terceros antes de usarlos.\n- Monitoriza y parchea las dependencias de forma regular.\n- Firma, verifica y audita las actualizaciones de software y paquetes.\n- Cierra a conciencia los procesos CI/CD y construcción para prevenir la manipulación.\n- Rastrea el origen y licencias de las dependencias.\n- Implementa monitorización de tiempo de ejecución para comportamiento inusual de dependencias o componentes IA.\n- Integra modelos de amenazas de cadena en el SDLC incluyendo testing, despliegue y workflows de actualizaciones.\n\n--------------------------------------------\n<h2>Reto</h2>\nNavega al puerto `5003` de la IP dada. El código está desactualizado e importa un componente viejo: `lib/vulnerable_utils.py`. ¿Puedes debuggearlo?\n\n1. Vamos a la página dada.\n   ![[Pasted image 20251219123146.png]]\n2. Interceptamos la petición al endpoint `/api/process`.\n   ![[Pasted image 20251219124029.png]]\n3. Cambiamos el método a POST, metemos un JSON con el campo `data` con un texto cualquiera y cambiamos el `Content-Type`.\n   ![[Pasted image 20251219124223.png]]\n4. No sabemos lo que mandar así que leeremos el archivo que nos dan en la tarea.\n   ![[Pasted image 20251219125858.png]]\n   Sobre la linea 23 podemos ver información relevante.\n5. Vamos a proceder a mandar la palabra `debug`.\n   ![[Pasted image 20251219130011.png]]",
    "modified": "2025-12-20T01:49:23"
  }
]