[
  {
    "title": "2. Overview of CSRF Attack",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/4-advanced-client-side-attacks/2-csrf/2-overview-of-csrf-attack/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/4. Advanced Client-Side Attacks/2. CSRF/2. Overview of CSRF Attack.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 4. Advanced Client-Side Attacks > 2. CSRF",
    "content": "<h2>¿Qué es CSRF?</h2>\nCSRF es un tipo de vulnerabilidad de seguridad donde un atacante engaña al navegador de un usuario para que realice acciones no intencionadas en un sitio web de confianza del usuario donde este está autentificado. Se consigue explotando el hecho de que el navegador incluye cualquier cookie relevante (credenciales) automáticamente, permitiendo al atacante suplantar y subir peticiones no autorizadas en nombre del usuario (a través del navegador). El sitio web del atacante puede contener formularios HTML o código JavaScript que está intencionado para mandar queries a la aplicación web objetivo.\n\n-------------------------------------\n<h2>Ciclo de CSRF</h2>\nUn ataque CSRF tiene tres fases esenciales:\n\n1. El atacante sabe el formato de las peticiones de la aplicación web para realizar una tarea particular y manda un link malicioso al usuario.\n2. La identidad de la víctima se verifica en la web, típicamente por cookies transmitidas automáticamente con cada petición y hace click en el link compartido por el atacante. Esta interacción podría ser un click, mouse over o cualquier otra acción.\n3. Medidas de seguridad insuficientes previenen a la aplicación web de distinguir peticiones auténticas de aquellas falsificadas.\n\n![[Pasted image 20260215113846.png]]\n\n----------------------------\n<h2>Efectos de CSRF</h2>\nEntender el impacto de CSRF es crucial para mantener las actividades online seguras. Aunque los ataques CSRF no exponen directamente la información de los usuarios, puede seguir causando mucho daño cambiando las contraseñas, cuentas de correo o haciendo transacciones financieras. Los riesgos asociados a CSRF incluyen:\n\n- **Acceso no autorizado:** Los atacantes pueden acceder y controlar las acciones de un usuario suponiendo un riesgo de pérdida de dinero, daño de su reputación y enfrentarse a consecuencias legales.\n- **Explotación de confianza:** CSRF explota la confianza que los sitios web ponen en los usuarios.\n- **Explotación sigilosa:** Funciona silenciosamente sin necesidad de malware avanzado. Los usuarios pueden no sospechar de un ataque, haciéndolos más vulnerables a explotación repetida.",
    "modified": "2026-02-16T01:08:34"
  },
  {
    "title": "3. Types of CSRF Attack",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/4-advanced-client-side-attacks/2-csrf/3-types-of-csrf-attack/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/4. Advanced Client-Side Attacks/2. CSRF/3. Types of CSRF Attack.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 4. Advanced Client-Side Attacks > 2. CSRF",
    "content": "<h2>CSRF Tradicional</h2>\nLos ataques CSRF convencionales suelen concentrarse en acciones de estado cambiante llevadas a cabo subiendo formularios. La víctima es engañada para subir un formulario sin darse cuenta de las cookies asociadas, los parámetros de la URL, etc. El servidor web de la víctima manda una petición HTTP a la aplicación web donde la víctima ya está autentificada. Estas suelen ser para transferir dinero, modificar información de la cuenta o alterar una dirección de correo electrónico.\n\n![[Pasted image 20260215113909.png]]\n\nEl diagrama de arriba muestra los pasos tradicionales de un ataque CSRF:\n\n- La víctima ya está autentificada en su sitio de banco online. Los atacantes crean un link malicioso y se lo mandan a la víctima.\n- La víctima abre el email en el mismo navegador.\n- Una vez hecho click, el link malicioso permite la autotransferencia de dinero del navegador de la víctima a la cuenta del atacante.\n\n----------------------------------------\n<h2>CSRF XMLHttpRequest</h2>\nLa explotación CSRF asíncrona ocurre cuando las operaciones se inician sin un ciclo completo de página petición-respuesta. Esto es típico de las apps online contemporáneas que aprovechan la comunicación asíncrona con el servidor (via XMLHttpRequest o Fetch API) y JavaScript para producir interfaces de usuario más dinámicas.\n\nConsidera un cliente de email online, por ejemplo, cuando un usuario puede cambiar sus preferencias de email sin recargar la página. Si esta aplicación es vulnerable a CSRF, un hacker puede crear una petición asíncrona falsa y alterar las preferencias de la víctima, autoreenviando toda su correspondencia a una dirección maliciosa.\n\nEsta es una vista simplificada de los pasos que un ataque asíncrono podría tomar:\n\n- La víctima abre una sesión guardada en las cookies de su navegador y se registra en `mailbox.thm`.\n- El atacante incita a la víctima a abrir una página maliciosa con un script que pueda mandar queries a `mailbox.thm`.\n- Para modificar las preferencias de reenvío de su email, el script malicioso en la página del atacante hace una llamada AJAX a `mailbox.thm/api/updateEmail` (usando XMLHttpRequest o Fetch).\n- La cookie de sesión de `mailbox.thm` se incluye con la petición AJAX en el navegador de la víctima.\n- Después de recibir la petición AJAX, `mailbox.thm` evalúa y modifica la configuración de la víctima si no existe protección CSRF.\n\n----------------------------------------\n<h2>CSRF Basado en Flash</h2>\nEl término \"Flash-Based CSRF\" describe la técnica de realizar un ataque CSRF aprovechando las debilidades de los componentes Adobe Flash Player. Las aplicaciones de internet con funcionalidades como contenido interactivo, streaming de vídeo, y animaciones complejas, han sido posibles gracias a Flash. Sin embargo, a medida que ha pasado el tiempo, las debilidades de seguridad en Flash, particularmente aquellas usadas para lanzar CSRF, se han vuelto mayores. Al desarrollarse la tecnología HTML5, las debilidades se multiplicaron cesando su soporte (Adobe Flash Player) el 31 de Diciembre de 2020.\n\nIncluso aunque Flash ya no es mantenido, es necesario hablar de él por el legado que ha dejado en el internet que hoy conocemos. Un archivo malicioso de flash (`.swf`) mandará una petición no autorizada a otras webs.",
    "modified": "2026-02-16T01:08:34"
  },
  {
    "title": "4. Basic CSRF - Hidden Link-Image Exploitation",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/4-advanced-client-side-attacks/2-csrf/4-basic-csrf-hidden-link-image-exploitation/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/4. Advanced Client-Side Attacks/2. CSRF/4. Basic CSRF - Hidden Link-Image Exploitation.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 4. Advanced Client-Side Attacks > 2. CSRF",
    "content": "<h2>Vista General</h2>\nUna técnica cubierta conocida como \"hidden link/image exploitation\" en CSRF involucra a un atacante insertando una imagen de 0x0 píxeles o un link en una página web que sea prácticamente indetectable para el usuario. Típicamente el elemento `src` o `href` es configurado a la dirección de destino intencionada para actuar en nombre del usuario sin su conocimiento. Se aprovecha del hecho de que el navegador del usuario transfiere credenciales como cookies automáticamente.\n\n```html\n<!-- Website --> \n<a href=\"https://mybank.thm/transfer.php\" target=\"_blank\">Click Here</a>  \n<!-- User visits attacker's website while authenticated -->\n```\n\nEsta técnica se basa en sesiones autentificadas y utiliza ingeniería social para acercarse al usuario\n\n-----------------------------------------\n<h2>Cómo Funciona</h2>\nAhora que estás conectado a la VM, vamos a ver cómo funciona el ataque:\n\n- La máquina virtual representa la máquina de Josh, que usa Chrome para comprobar su email (`http://mailbox.thm:8081`) e iniciar sesión en su cuenta del banco (`http://mybank.thm:8080`). Debido a que es broker y debe hacer muchas transferencias diariamente, mantiene su sesión activa en el navegador todo el día.\n- El atacante, de alguna manera, averigua que Josh usa `mybank.thm:8080` para transacciones y que su cuenta siempre está activa.\n- El atacante también tiene una cuenta en el mismo banco, por lo que inicia sesión y busca vulnerabilidades.\n- Tú también puedes iniciar sesión en la cuenta de banco usando `GB82MYBANK5698:GB82MYBANK5698`.\n- Mientras escanea, encuentra que no se manda ningún parámetro adicional de la app de banco al transferir el pago. Este es el código que maneja la transferencia de fondos.\n\n```php\n<?php \n<form action=\"transfer.php\" method=\"post\">\n\n    <label for=\"to_account\">To Account:</label>\n    <input type=\"text\" id=\"to_account\" name=\"to_account\" required>\n\n    <label for=\"amount\">Amount:</label>\n    <input type=\"number\" id=\"amount\" name=\"amount\" required>\n\n    <button type=\"submit\">Transfer</button>\n</form>\n```\n\n- Aquí, el atacante puede emplear la técnica de la imagen escondida para construir un email y engañar a la víctima para que haga click en el link. El atacante sólo conoce la dirección de email de Josh por lo que lanza un ataque de ingeniería social mandándole el siguiente email.\n\n![[Pasted image 20260215131502.png]]\n\n- Lo más importante es que el atributo src de la imagen está configurado a la página de transferencia del banco. El atacante puede esconderlo o poner una imagen válida con la etiqueta anchor (`<a>`).\n\n```html\n<a href=\"http://mybank.thm:8080/dashboard.php?to_account=GB82MYBANK5698&amount=1000\" target=\"_blank\">Click Here to Redeem</a>\n```\n\n- Pare entender la perspectiva de la víctima, navega hasta la bandeja de entrada de Josh en `mailbox.thm:8081` para ver un nuevo email diciendo que ha ganado un viaje a Dubai y tiene que reclamarlo.\n- Una vez que hace click en el link, se le redirige a la página del banco de transferencias y los fondos son transferidos automáticamente.\n\n![[Pasted image 20260215131826.png]]\n\n------------------------------------\n<h2>¿Cuál era el Link Faltante?</h2>\nTodas las validaciones son correctas y precisas, sin embargo, el servidor no valida si la petición viene de un usuario legítimo.\n\n------------------------------------\n<h2>Securizando la Brecha</h2>\n- Desde el punto de vista de un pentester, es vital testear cada parámetro de petición y respuesta del formulario.\n- Desde el punto de vista del desarrollador, es importante asegurar que cada petición subida al servidor web contiene un token único para que el servidor pueda identificar si se ha hecho click a partir de un enlace válido.\n- El equipo IT del banco identifican rápidamente el problema y añaden un token CSRF con cada petición subida al servidor. El siguiente código contiene el código actualizado del lado del cliente. Podemos ver que hay un parámetro extra escondido, `csrf_token`, que será mandado al servidor con cada petición.\n\n```html\n<form method=\"post\" action=\"\">\n        <label for=\"password\">Password:</label>\n        <input type=\"password\" id=\"password\" name=\"current_password\" required>\n\n        <label for=\"confirm_password\">ConfirmPassword:</label>\n        <input type=\"password\" id=\"confirm_password\" name=\"confirm_password\" required>\n\t\t<input type=\"hidden\" id=\"csrf_token\" name=\"csrf_token\" value=\"<?php echo $_COOKIE['csrf-token']; ?>\">\n        <button type=\"submit\" name=\"password_submit\" >Update Password</button>\n    </form>submit\">\n</form> \n```\n\n- Del lado del servidor, este verificará si cada petición entrante contiene un token único, de no ser así lo rechaza.\n- Abre la bandeja de entrada de Josh y navega hasta el email del atacante con la chapa verde.\n\n![[Pasted image 20260215132719.png]]\n\n- Cuando el usuario hace click en el link, no transferirá los fondos ya que a la petición le falta el token CSRF único.\n\n![[Pasted image 20260215132809.png]]",
    "modified": "2026-02-16T01:08:34"
  },
  {
    "title": "2. Getting the Flags",
    "path": "/apuntes/thm/maquinas/2-medium/7-include/2-getting-the-flags/",
    "src": "content/Ciberseguridad/THM/Maquinas/2. Medium/7. Include/2. Getting the Flags.md",
    "breadcrumb": "THM > Maquinas > 2. Medium > 7. Include",
    "content": "<h2>¿Cuál es la flag después de iniciar sesión en SysMon App?</h2>\n<h4>Escaneo Inicial</h4>\n1. Empezamos realizando un escaneo a todos los puertos de la IP.\n   ![[Pasted image 20260211205256.png]]\n2. Una vez tenemos el escaneo inicial vamos a lanzar un escaneo con todo contra estos puertos.\n   ![[Pasted image 20260211213811.png]]\n   ![[Pasted image 20260211213836.png]]\n   Podemos ver que el puerto 50000 está sirviendo un Apache 2.4.41 y el 4000 un Node.js en http, por lo que como siempre que vemos un servicio web, vamos a ver qué hay.\n\n<h4>Investigación de Puertos</h4>\n1. Vamos a ver qué hay en el puerto 50000.\n   ![[Pasted image 20260211214240.png]]\n2. Y en el puerto 4000.\n   ![[Pasted image 20260211214303.png]]\n\n<h4>Investigación Web</h4>\n1. Empezamos fuzzeando.\n\t1. En el puerto 50000.\n\t   ![[Pasted image 20260211221934.png]]\n\t2. En el puerto 4000.\n\t   ![[Pasted image 20260211222041.png]]\n2. Seguimos intentando SQL Injection.\n\t1. En el puerto 50000.\n\t   ![[Pasted image 20260211222327.png]]\n\t   ![[Pasted image 20260211222350.png]]\n\t   Capturé una petición para usarla con SQLMap (era un formulario POST) pero no había ningún parámetro inyectable.\n\t2. En el puerto 4000 no nos hace falta porque nos han dejado credenciales de acceso.\n\t   ![[Pasted image 20260211221457.png]]\n3. Vamos a meternos en nuestro perfil.\n   ![[Pasted image 20260213170025.png]]\n   Parece que son objetos. Si vamos más abajo podemos ver una manera de lo que parece compartir notas.\n   ![[Pasted image 20260213170059.png]]\n4. Si metemos una nota random como `Book:testBook` se ve reflejado en el perfil, lo que nos lleva a preguntarnos si podremos modificarlos.\n   ![[Pasted image 20260213170143.png]]\n5. Probaremos a introducir `isAdmin:true`.\n   ![[Pasted image 20260213170241.png]]\n6. Se ha cambiado y nos han aparecido dos opciones que antes no había:\n\t1. Settings:\n\t   ![[Pasted image 20260213170335.png]]\n\t2. API:\n\t   ![[Pasted image 20260213170352.png]]\n7. Vamos a comprobar si el link de settings realiza peticiones:\n\t1. Configuramos un servidor sencillito:\n\t   ![[Pasted image 20260213170446.png]]\n\t2. Introducimos nuestra URL en la caja y pulsamos enter.\n\t   ![[Pasted image 20260213170554.png]]\n\t3. Observamos si hay conexión.\n\t   ![[Pasted image 20260213170617.png]]\n8. Vamos a probar a hacer una petición a la API interna con la dirección del endpoint censurado: `getAllAdmins101099991`.\n   ![[Pasted image 20260213170830.png]]\n   Obtenemos lo siguiente:\n   ![[Pasted image 20260213170845.png]]\n9. Vamos a decodificarlo.\n   ![[Pasted image 20260213171019.png]]\n10. Iniciamos sesión en SysMon con las credenciales obtenidas.\n    ![[Pasted image 20260213171141.png]]\n    \n\n>[!SUCCESS] Y así obtenemos la primera flag.\n>\n\n\n--------------------------------------\n<h2>¿Cuál es el contenido del archivo de texto escondido en /var/www/html?</h2>\n<h4>Investigación Web</h4>\n1. Estando ya en la página del administrador, vamos a mirar desde dónde se carga la imagen de perfil del usuario `administrator`.\n   ![[Pasted image 20260214160839.png]]\n   Parece ser que está cargando la foto desde una ruta interna. Esto huele a LFI de manual.\n2. Vamos a intentar acceder a `/etc/passwd`.\n\t1. Primero vamos a la ruta.\n\t   ![[Pasted image 20260214161438.png]]\n\t2. Ahora vamos a probar un par de payloads (`../../` y `....//....//`).\n\t   ![[Pasted image 20260214161839.png]]\n\t   Ninguno ha funcionado, por lo que vamos a fuzzear.\n\t3. Preparamos el comando y lo lanzamos.\n\t   ![[Pasted image 20260214162023.png]]\n\t   Después de probar un par de diccionarios encontramos varios payloads que funcionan.\n\t4. Si miramos en la web uno de estos payloads:\n\t   ![[Pasted image 20260214162141.png]]\n\t   Observamos que hay dos usuarios `joshua` y `charles`, puede que nos ayude más tarde. También hay un mail server.\n3. Si recordamos el escaneo inicial, había varios servicios que nos hacían pensar que podía haber algo relacionado con el mail. Si buscamos en internet:\n   ![[Pasted image 20260214162358.png]]\n4. Vamos a intentar leerlo.\n   ![[Pasted image 20260214162441.png]]\n   Parece que está vacío.\n5. Vamos a intentar mandar un mail al servidor para ver si se registra en los logs aprovechando que el puerto 25 está abierto.\n\t1. Buscamos la sintaxis para mandar emails por telnet en SMTP (25).\n\t   ![[Pasted image 20260214162919.png]]\n\t2. Lo replicamos.\n\t   ![[Pasted image 20260214163129.png]]\n\t3. Vamos a ver si se ha registrado.\n\t   ![[Pasted image 20260214163200.png]]\n\t   Sí que se ha registrado. Huele a log poisoning debido a que aparece lo que hemos indicado.\n\t   ![[Pasted image 20260214163340.png]]\n\t4. Vamos a intentar un log poisoning con una webshell en php: `<?php system($_GET['cmd']);?>`\n\t   ![[Pasted image 20260214170010.png]]\n\t5. Ahora intentamos cargar la página con el parámetro `&cmd=whoami`.\n\t   ![[Pasted image 20260214170028.png]]\n\t6. Vamos a listar ahora `/var/www/html`.\n\t   ![[Pasted image 20260214170138.png]]\n\t7. Lo leemos.\n\t   ![[Pasted image 20260214170234.png]]\n\n>[!SUCCESS] Hemos conseguido obtener las dos flags!!",
    "modified": "2026-02-16T01:08:34"
  },
  {
    "title": "0. Whats Your Name",
    "path": "/apuntes/thm/maquinas/2-medium/9-whats-your-name/0-whats-your-name/",
    "src": "content/Ciberseguridad/THM/Maquinas/2. Medium/9. Whats Your Name/0. Whats Your Name.md",
    "breadcrumb": "THM > Maquinas > 2. Medium > 9. Whats Your Name",
    "content": "[[Ciberseguridad/THM/Maquinas/2. Medium/9. Whats Your Name/1. Getting the flags]]",
    "modified": "2026-02-15T01:10:58"
  }
]